In [1]:
%load_ext sql

In [2]:
%sql sqlite:///./test.db

'Connected: @./test.db'

In [3]:
%%sql
DROP TABLE IF EXISTS Employee;
CREATE TABLE Employee (EmpID int, EmpName varchar(25), Salary int, DeptID int);

 * sqlite:///./test.db
Done.
Done.

[]

In [4]:
%%sql
INSERT INTO Employee
VALUES
(1001, 'Mark', 60000, 2),
(1002, 'Antony', 40000, 2),
(1003, 'Andrew', 15000, 1),
(1004, 'Peter', 35000, 1),
(1005, 'John', 55000, 1),
(1006, 'Albert', 25000, 3),
(1007, 'Donald', 35000, 3);

 * sqlite:///./test.db
7 rows affected.

[]

In [5]:
%sql select * from Employee

 * sqlite:///./test.db
Done.

[(1001, 'Mark', 60000, 2),
 (1002, 'Antony', 40000, 2),
 (1003, 'Andrew', 15000, 1),
 (1004, 'Peter', 35000, 1),
 (1005, 'John', 55000, 1),
 (1006, 'Albert', 25000, 3),
 (1007, 'Donald', 35000, 3)]

SQL to find All Employees who earn more than average salary in their corresponding department

In [6]:
%%sql
select t1.*,t2.avg_salary AvgSalary
from Employee t1 join (select DeptId,avg(salary) avg_salary from Employee group by DeptId) t2
on t1.DeptId=t2.DeptId
where t1.salary > t2.avg_salary

 * sqlite:///./test.db
Done.

[(1001, 'Mark', 60000, 2, 50000.0),
 (1005, 'John', 55000, 1, 35000.0),
 (1007, 'Donald', 35000, 3, 30000.0)]

In [10]:
%%sql 
select empid,empname,salary,deptid,avgdeptsalary from (
select empid,empname,salary,deptid,avg(salary) over(partition by deptid) avgdeptsalary
from Employee)x where x.salary > x.avgdeptsalary

 * sqlite:///./test.db
Done.

[(1005, 'John', 55000, 1, 35000.0),
 (1001, 'Mark', 60000, 2, 50000.0),
 (1007, 'Donald', 35000, 3, 30000.0)]